In [55]:
import pandas as pd
import numpy as np

In [7]:
#korean is encoded in utf-8
cctv_seoul = pd.read_csv('01.CCTV_in_Seoul.csv', encoding='utf-8')
#shows the first 5 rows
cctv_seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [9]:
#returns the columns in the csv file loaded
cctv_seoul.columns[0]

'기관명'

In [11]:
#this renames the first column to '구별'. inplace=True means to apply the changes
cctv_seoul.rename(columns={cctv_seoul.columns[0]: '구별'}, inplace=True)
cctv_seoul.columns

Index(['구별', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [12]:
cctv_seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [26]:
#header=2 means read from the second row, parse_cols means read the specified columns only
pop_seoul = pd.read_excel('01.population_in_Seoul.xls', 
                          header = 2,
                          parse_cols = 'B, D, G, J, N',
                          encoding='utf-8')

/Users/jonghobaeck/miniconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: FutureWarning: the 'parse_cols' keyword is deprecated, use 'usecols' instead
  """

In [27]:
pop_seoul.head()

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10068381  9793003  275378   1405404
1  종로구    163086   153396    9690     26622
2   중구    135258   125815    9443     21902
3  용산구    245087   229391   15696     37443
4  성동구    317197   309251    7946     42581

In [30]:
#see the columns
pop_seoul.columns

Index(['자치구', '계', '계.1', '계.2', '65세이상고령자'], dtype='object')

In [48]:
#however, these changes don't change the text in the original file, because we made an instanceo out of the file
pop_seoul.rename(columns={pop_seoul.columns[0]:'구별',
                          pop_seoul.columns[1]:'인구수',
                          pop_seoul.columns[2]:'한국인',
                          pop_seoul.columns[3]:'외국인',
                          pop_seoul.columns[4]:'고령자'}, inplace=True)
pop_seoul.head()

    구별       인구수      한국인     외국인      고령자
0   합계  10068381  9793003  275378  1405404
1  종로구    163086   153396    9690    26622
2   중구    135258   125815    9443    21902
3  용산구    245087   229391   15696    37443
4  성동구    317197   309251    7946    42581

In [49]:
pop_seoul.values

array([['합계', 10068381, 9793003, 275378, 1405404],
       ['종로구', 163086, 153396, 9690, 26622],
       ['중구', 135258, 125815, 9443, 21902],
       ['용산구', 245087, 229391, 15696, 37443],
       ['성동구', 317197, 309251, 7946, 42581],
       ['광진구', 369999, 355032, 14967, 45202],
       ['동대문구', 366101, 350556, 15545, 57096],
       ['중랑구', 409058, 404313, 4745, 61271],
       ['성북구', 449574, 438031, 11543, 67447],
       ['강북구', 324276, 320576, 3700, 57741],
       ['도봉구', 342990, 340876, 2114, 55499],
       ['노원구', 551069, 546911, 4158, 76466],
       ['은평구', 487849, 483417, 4432, 76643],
       ['서대문구', 322497, 310584, 11913, 50278],
       ['마포구', 385032, 374106, 10926, 50559],
       ['양천구', 469945, 466121, 3824, 57442],
       ['강서구', 605068, 598416, 6652, 78814],
       ['구로구', 439234, 406144, 33090, 61293],
       ['금천구', 252359, 232760, 19599, 35299],
       ['영등포구', 403724, 368577, 35147, 55364],
       ['동작구', 407925, 395513, 12412, 58803],
       ['관악구', 521685, 503956, 17729, 71840],
       ['서초구', 441539, 437407, 4132, 54887],
       ['강남구', 549255, 544257, 4998, 66412],
       ['송파구', 673582, 666892, 6690, 80220],
       ['강동구', 434992, 430705, 4287, 58280]], dtype=object)

# A Bit Into Numpy

In [51]:
#nan means Not A Number
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [56]:
#you can set the basic dates, and use 'periods' to set the ranges
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [57]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01  0.520675  0.591096  1.271091  0.624768
2013-01-02  0.036914  0.755692 -0.454409  0.776907
2013-01-03 -1.020354 -0.458555  0.640898 -1.600495
2013-01-04  0.115329 -0.873073 -0.306646  0.927985
2013-01-05 -0.284032 -0.024869 -1.541487  0.344168
2013-01-06  0.768082 -0.625404  0.982371 -1.817121

In [68]:
#this orders the dataframe by given data.
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-02  0.036914  0.755692 -0.454409  0.776907
2013-01-01  0.520675  0.591096  1.271091  0.624768
2013-01-05 -0.284032 -0.024869 -1.541487  0.344168
2013-01-03 -1.020354 -0.458555  0.640898 -1.600495
2013-01-06  0.768082 -0.625404  0.982371 -1.817121
2013-01-04  0.115329 -0.873073 -0.306646  0.927985

In [73]:
#shows results in column C
df['C']

2013-01-01    1.271091
2013-01-02   -0.454409
2013-01-03    0.640898
2013-01-04   -0.306646
2013-01-05   -1.541487
2013-01-06    0.982371
Freq: D, Name: C, dtype: float64

In [75]:
#you can select return specific rows as well
df[0:3]

                   A         B         C         D
2013-01-01  0.520675  0.591096  1.271091  0.624768
2013-01-02  0.036914  0.755692 -0.454409  0.776907
2013-01-03 -1.020354 -0.458555  0.640898 -1.600495

In [82]:
#or you can do this
df['2013-01-02':'20130104']

                   A         B         C         D
2013-01-02  0.036914  0.755692 -0.454409  0.776907
2013-01-03 -1.020354 -0.458555  0.640898 -1.600495
2013-01-04  0.115329 -0.873073 -0.306646  0.927985

In [87]:
#loc is a slicing option
df.loc[dates[0:2]]

                   A         B         C         D
2013-01-01  0.520675  0.591096  1.271091  0.624768
2013-01-02  0.036914  0.755692 -0.454409  0.776907

In [94]:
df.loc[:, ['A', 'B']]
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.036914  0.755692
2013-01-03 -1.020354 -0.458555
2013-01-04  0.115329 -0.873073

In [95]:
df.loc['20130102', ['A', 'B']]

A    0.036914
B    0.755692
Name: 2013-01-02 00:00:00, dtype: float64

In [97]:
df

                   A         B         C         D
2013-01-01  0.520675  0.591096  1.271091  0.624768
2013-01-02  0.036914  0.755692 -0.454409  0.776907
2013-01-03 -1.020354 -0.458555  0.640898 -1.600495
2013-01-04  0.115329 -0.873073 -0.306646  0.927985
2013-01-05 -0.284032 -0.024869 -1.541487  0.344168
2013-01-06  0.768082 -0.625404  0.982371 -1.817121

## Using iloc

In [98]:
#using only number in iloc returns the specified row
df.iloc[3]

A    0.115329
B   -0.873073
C   -0.306646
D    0.927985
Name: 2013-01-04 00:00:00, dtype: float64

In [99]:
#the first bracket refers to row specification, and the second bracket refers to the column specification
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.115329 -0.873073
2013-01-05 -0.284032 -0.024869

In [101]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.036914 -0.454409
2013-01-03 -1.020354  0.640898
2013-01-05 -0.284032 -1.541487

In [107]:
# :refers to whole
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.036914  0.755692 -0.454409  0.776907
2013-01-03 -1.020354 -0.458555  0.640898 -1.600495

In [108]:
#this shows all the values in column A
df['A']

2013-01-01    0.520675
2013-01-02    0.036914
2013-01-03   -1.020354
2013-01-04    0.115329
2013-01-05   -0.284032
2013-01-06    0.768082
Freq: D, Name: A, dtype: float64

In [109]:
#this retrieves all values of dates whose values in A is greater than 0
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.520675  0.591096  1.271091  0.624768
2013-01-02  0.036914  0.755692 -0.454409  0.776907
2013-01-04  0.115329 -0.873073 -0.306646  0.927985
2013-01-06  0.768082 -0.625404  0.982371 -1.817121

In [111]:
# this retrieves all data for which the values are greater than 0.
# if not greater than 0, they will be given NaN.
df[df > 0]

                   A         B         C         D
2013-01-01  0.520675  0.591096  1.271091  0.624768
2013-01-02  0.036914  0.755692       NaN  0.776907
2013-01-03       NaN       NaN  0.640898       NaN
2013-01-04  0.115329       NaN       NaN  0.927985
2013-01-05       NaN       NaN       NaN  0.344168
2013-01-06  0.768082       NaN  0.982371       NaN